src/Catalogs/ХранилищеКонфиденциальнойИнформации/ХранилищеКонфиденциальнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеКонфиденциальнойИнформации</name>
  <attributes>
    <name>КонтурАдминистрирования</name>
    <type>
      <types>CatalogRef.КонтурыАдминистрирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ХранилищеКонфиденциальнойИнформации/Forms/ФормаСписка/Module.bsl
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборПоДоступным();	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступным()
	Если Не РаботаСоСценариямиАвтоматизацииПраваДоступа.ПроверитьНаличиеПолногоДоступаКФункционалуАвтоматизации() Тогда
		Ограничения = РаботаСоСценариямиАвтоматизацииПовторноеИспользование.ПолучитьСписокОграниченийДляТекущегоПользователя();
		
		Если Ограничения.Количество() > 0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	ХранилищеКонфиденциальнойИнформации.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	Справочник.ХранилищеКонфиденциальнойИнформации КАК ХранилищеКонфиденциальнойИнформации
			                      |ГДЕ
			                      |	(ХранилищеКонфиденциальнойИнформации.КонтурАдминистрирования В (&ДоступныеКонтуры)
			                      |			ИЛИ ХранилищеКонфиденциальнойИнформации.КонтурАдминистрирования = ЗНАЧЕНИЕ(Справочник.КонтурыАдминистрирования.ПустаяСсылка))");
			Запрос.УстановитьПараметр("ДоступныеКонтуры", Ограничения);
			
			ОтборСписка = Запрос.Выполнить().Выгрузить();
			
			РаботаСоСценариямиАвтоматизацииПраваДоступа.УстановитьОтборПоДоступнымЭлементамНаСписокФормы(Список, ОтборСписка.ВыгрузитьКолонку("Ссылка"));
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры	

#КонецОбласти
